# IsTransmitted Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TransmissionData..::..IsTransmitted Property
TransmissionData Class See Also
---
Determines whether this file has been transmitted or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsTransmitted { get; set; }
```

Visual Basic
---
```text
Public Property IsTransmitted As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsTransmitted {
	bool get ();
	void set (bool value);
}
```

# Remarks
"Transmitted" files have been moved from one place to another and are considered to be in a not-final state. Revit will read the TransmissionData on file open and overwrite any data stored in the external file reference elements themselves.
# See Also
TransmissionData Class
Autodesk.Revit.DB Namespace